That's interesting, after I run `terraform apply` after a few hours (when the network was deleted for sure) I can see:
```
confluent_environment.development: Refreshing state... [id=env-o25nwy]
confluent_network.aws-private-link: Refreshing state... [id=n-pdz196]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_network.aws-private-link will be created
  + resource "confluent_network" "aws-private-link" {
      + cidr             = (known after apply)
      + cloud            = "AWS"
      + connection_types = [
          + "PRIVATELINK",
        ]
      + display_name     = "AWS Private Link Network"
      + id               = (known after apply)
      + region           = "us-east-2"
      + resource_name    = (known after apply)
      + zones            = (known after apply)

      + aws {
          + private_link_endpoint_service = (known after apply)
          + vpc                           = (known after apply)
        }

      + azure {
          + private_link_service_aliases = (known after apply)
        }

      + environment {
          + id = "env-o25nwy"
        }

      + gcp {
          + project     = (known after apply)
          + vpc_network = (known after apply)
        }
    }

  # confluent_private_link_access.aws will be created
  + resource "confluent_private_link_access" "aws" {
      + display_name = "AWS Private Link Access"
      + id           = (known after apply)

      + aws {
          + account = "012345678901"
        }

      + environment {
          + id = "env-o25nwy"
        }

      + network {
          + id = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 
```